{"keras_version": "2.2.4-tf", "config": {"layers": [{"config": {"sparse": false, "batch_input_shape": [null, 28, 28, 1], "name": "input_19", "dtype": "float32"}, "name": "input_19", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"output_layers": [["conv2d_56", 0, 0]], "input_layers": [["input_19", 0, 0]], "layers": [{"config": {"sparse": false, "dtype": "float32", "name": "input_19", "batch_input_shape": [null, 28, 28, 1]}, "name": "input_19", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "name": "conv2d_54", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_constraint": null, "filters": 16}, "name": "conv2d_54", "inbound_nodes": [[["input_19", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "name": "conv2d_55", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_constraint": null, "filters": 16}, "name": "conv2d_55", "inbound_nodes": [[["conv2d_54", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"padding": "same", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "dtype": "float32", "name": "max_pooling2d_9", "strides": [2, 2]}, "name": "max_pooling2d_9", "inbound_nodes": [[["conv2d_55", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "name": "conv2d_56", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_constraint": null, "filters": 1}, "name": "conv2d_56", "inbound_nodes": [[["max_pooling2d_9", 0, 0, {}]]], "class_name": "Conv2D"}], "name": "model_27"}, "name": "model_27", "inbound_nodes": [[["input_19", 0, 0, {}]]], "class_name": "Model"}, {"config": {"output_layers": [["conv2d_59", 0, 0]], "input_layers": [["input_20", 0, 0]], "layers": [{"config": {"sparse": false, "dtype": "float32", "name": "input_20", "batch_input_shape": [null, 14, 14, 1]}, "name": "input_20", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "name": "conv2d_57", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_constraint": null, "filters": 16}, "name": "conv2d_57", "inbound_nodes": [[["input_20", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_9", "dtype": "float32"}, "name": "up_sampling2d_9", "inbound_nodes": [[["conv2d_57", 0, 0, {}]]], "class_name": "UpSampling2D"}, {"config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "name": "conv2d_58", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_constraint": null, "filters": 16}, "name": "conv2d_58", "inbound_nodes": [[["up_sampling2d_9", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "name": "conv2d_59", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_constraint": null, "filters": 1}, "name": "conv2d_59", "inbound_nodes": [[["conv2d_58", 0, 0, {}]]], "class_name": "Conv2D"}], "name": "model_28"}, "name": "model_28", "inbound_nodes": [[["model_27", 1, 0, {}]]], "class_name": "Model"}], "input_layers": [["input_19", 0, 0]], "output_layers": [["model_28", 1, 0]], "name": "model_29"}, "backend": "tensorflow", "class_name": "Model"}