{"config": {"layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32"}}, {"name": "model", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Model", "config": {"layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32"}}, {"name": "conv2d", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "filters": 16, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32", "trainable": true, "padding": "same", "kernel_constraint": null, "activation": "relu", "name": "conv2d", "dilation_rate": [1, 1], "use_bias": true}}, {"name": "conv2d_1", "inbound_nodes": [[["conv2d", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "filters": 16, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32", "trainable": true, "padding": "same", "kernel_constraint": null, "activation": "relu", "name": "conv2d_1", "dilation_rate": [1, 1], "use_bias": true}}, {"name": "max_pooling2d", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "padding": "same", "pool_size": [2, 2], "name": "max_pooling2d", "strides": [2, 2], "dtype": "float32"}}, {"name": "conv2d_2", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "filters": 1, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32", "trainable": true, "padding": "same", "kernel_constraint": null, "activation": "linear", "name": "conv2d_2", "dilation_rate": [1, 1], "use_bias": true}}], "name": "model", "output_layers": [["conv2d_2", 0, 0]], "input_layers": [["input_1", 0, 0]]}}, {"name": "model_1", "inbound_nodes": [[["model", 1, 0, {}]]], "class_name": "Model", "config": {"layers": [{"name": "input_2", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_2", "sparse": false, "batch_input_shape": [null, 14, 14, 1], "dtype": "float32"}}, {"name": "conv2d_3", "inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "filters": 16, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32", "trainable": true, "padding": "same", "kernel_constraint": null, "activation": "relu", "name": "conv2d_3", "dilation_rate": [1, 1], "use_bias": true}}, {"name": "up_sampling2d", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"name": "up_sampling2d", "trainable": true, "data_format": "channels_last", "size": [2, 2], "dtype": "float32"}}, {"name": "conv2d_4", "inbound_nodes": [[["up_sampling2d", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "filters": 16, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32", "trainable": true, "padding": "same", "kernel_constraint": null, "activation": "relu", "name": "conv2d_4", "dilation_rate": [1, 1], "use_bias": true}}, {"name": "conv2d_5", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "filters": 1, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32", "trainable": true, "padding": "same", "kernel_constraint": null, "activation": "linear", "name": "conv2d_5", "dilation_rate": [1, 1], "use_bias": true}}], "name": "model_1", "output_layers": [["conv2d_5", 0, 0]], "input_layers": [["input_2", 0, 0]]}}], "name": "model_2", "output_layers": [["model_1", 1, 0]], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.4-tf"}