{"keras_version": "2.2.4-tf", "config": {"layers": [{"config": {"sparse": false, "batch_input_shape": [null, 28, 28, 1], "name": "input_5", "dtype": "float32"}, "name": "input_5", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"output_layers": [["conv2d_14", 0, 0]], "input_layers": [["input_5", 0, 0]], "layers": [{"config": {"sparse": false, "dtype": "float32", "name": "input_5", "batch_input_shape": [null, 28, 28, 1]}, "name": "input_5", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "name": "conv2d_12", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_constraint": null, "filters": 16}, "name": "conv2d_12", "inbound_nodes": [[["input_5", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "name": "conv2d_13", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_constraint": null, "filters": 16}, "name": "conv2d_13", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"padding": "same", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "dtype": "float32", "name": "max_pooling2d_2", "strides": [2, 2]}, "name": "max_pooling2d_2", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "name": "conv2d_14", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_constraint": null, "filters": 1}, "name": "conv2d_14", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D"}], "name": "model_6"}, "name": "model_6", "inbound_nodes": [[["input_5", 0, 0, {}]]], "class_name": "Model"}, {"config": {"output_layers": [["conv2d_17", 0, 0]], "input_layers": [["input_6", 0, 0]], "layers": [{"config": {"sparse": false, "dtype": "float32", "name": "input_6", "batch_input_shape": [null, 14, 14, 1]}, "name": "input_6", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "name": "conv2d_15", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_constraint": null, "filters": 16}, "name": "conv2d_15", "inbound_nodes": [[["input_6", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_2", "dtype": "float32"}, "name": "up_sampling2d_2", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "UpSampling2D"}, {"config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "name": "conv2d_16", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_constraint": null, "filters": 16}, "name": "conv2d_16", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "name": "conv2d_17", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_constraint": null, "filters": 1}, "name": "conv2d_17", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "Conv2D"}], "name": "model_7"}, "name": "model_7", "inbound_nodes": [[["model_6", 1, 0, {}]]], "class_name": "Model"}], "input_layers": [["input_5", 0, 0]], "output_layers": [["model_7", 1, 0]], "name": "model_8"}, "backend": "tensorflow", "class_name": "Model"}