{"keras_version": "2.2.4-tf", "config": {"layers": [{"config": {"sparse": false, "batch_input_shape": [null, 28, 28, 1], "name": "input_17", "dtype": "float32"}, "name": "input_17", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"output_layers": [["conv2d_50", 0, 0]], "input_layers": [["input_17", 0, 0]], "layers": [{"config": {"sparse": false, "dtype": "float32", "name": "input_17", "batch_input_shape": [null, 28, 28, 1]}, "name": "input_17", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "name": "conv2d_48", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_constraint": null, "filters": 16}, "name": "conv2d_48", "inbound_nodes": [[["input_17", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "name": "conv2d_49", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_constraint": null, "filters": 16}, "name": "conv2d_49", "inbound_nodes": [[["conv2d_48", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"padding": "same", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "dtype": "float32", "name": "max_pooling2d_8", "strides": [2, 2]}, "name": "max_pooling2d_8", "inbound_nodes": [[["conv2d_49", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "name": "conv2d_50", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_constraint": null, "filters": 1}, "name": "conv2d_50", "inbound_nodes": [[["max_pooling2d_8", 0, 0, {}]]], "class_name": "Conv2D"}], "name": "model_24"}, "name": "model_24", "inbound_nodes": [[["input_17", 0, 0, {}]]], "class_name": "Model"}, {"config": {"output_layers": [["conv2d_53", 0, 0]], "input_layers": [["input_18", 0, 0]], "layers": [{"config": {"sparse": false, "dtype": "float32", "name": "input_18", "batch_input_shape": [null, 14, 14, 1]}, "name": "input_18", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "name": "conv2d_51", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_constraint": null, "filters": 16}, "name": "conv2d_51", "inbound_nodes": [[["input_18", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_8", "dtype": "float32"}, "name": "up_sampling2d_8", "inbound_nodes": [[["conv2d_51", 0, 0, {}]]], "class_name": "UpSampling2D"}, {"config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "name": "conv2d_52", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_constraint": null, "filters": 16}, "name": "conv2d_52", "inbound_nodes": [[["up_sampling2d_8", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "name": "conv2d_53", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_constraint": null, "filters": 1}, "name": "conv2d_53", "inbound_nodes": [[["conv2d_52", 0, 0, {}]]], "class_name": "Conv2D"}], "name": "model_25"}, "name": "model_25", "inbound_nodes": [[["model_24", 1, 0, {}]]], "class_name": "Model"}], "input_layers": [["input_17", 0, 0]], "output_layers": [["model_25", 1, 0]], "name": "model_26"}, "backend": "tensorflow", "class_name": "Model"}