{"keras_version": "2.2.4-tf", "config": {"layers": [{"config": {"sparse": false, "batch_input_shape": [null, 28, 28, 1], "name": "input_1", "dtype": "float32"}, "name": "input_1", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"output_layers": [["conv2d_2", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"config": {"sparse": false, "dtype": "float32", "name": "input_1", "batch_input_shape": [null, 28, 28, 1]}, "name": "input_1", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "name": "conv2d", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_constraint": null, "filters": 16}, "name": "conv2d", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "name": "conv2d_1", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_constraint": null, "filters": 16}, "name": "conv2d_1", "inbound_nodes": [[["conv2d", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"padding": "same", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "dtype": "float32", "name": "max_pooling2d", "strides": [2, 2]}, "name": "max_pooling2d", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "name": "conv2d_2", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_constraint": null, "filters": 1}, "name": "conv2d_2", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "class_name": "Conv2D"}], "name": "model"}, "name": "model", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Model"}, {"config": {"output_layers": [["conv2d_5", 0, 0]], "input_layers": [["input_2", 0, 0]], "layers": [{"config": {"sparse": false, "dtype": "float32", "name": "input_2", "batch_input_shape": [null, 14, 14, 1]}, "name": "input_2", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "name": "conv2d_3", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_constraint": null, "filters": 16}, "name": "conv2d_3", "inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d", "dtype": "float32"}, "name": "up_sampling2d", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "UpSampling2D"}, {"config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "name": "conv2d_4", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_constraint": null, "filters": 16}, "name": "conv2d_4", "inbound_nodes": [[["up_sampling2d", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "name": "conv2d_5", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_constraint": null, "filters": 1}, "name": "conv2d_5", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "Conv2D"}], "name": "model_1"}, "name": "model_1", "inbound_nodes": [[["model", 1, 0, {}]]], "class_name": "Model"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["model_1", 1, 0]], "name": "model_2"}, "backend": "tensorflow", "class_name": "Model"}