{"config": {"name": "model", "layers": [{"name": "input_1", "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 29], "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "sequential", "config": {"name": "sequential", "layers": [{"config": {"trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null, "dtype": "float32", "activation": "relu", "batch_input_shape": [null, 29], "units": 20, "kernel_constraint": null, "name": "dense", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null, "dtype": "float32", "activation": "relu", "batch_input_shape": [null, 20], "units": 15, "kernel_constraint": null, "name": "dense_1", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null, "dtype": "float32", "activation": "relu", "batch_input_shape": [null, 15], "units": 10, "kernel_constraint": null, "name": "dense_2", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null, "dtype": "float32", "activation": "linear", "batch_input_shape": [null, 10], "units": 10, "kernel_constraint": null, "name": "dense_3", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Sequential"}, {"name": "sequential_1", "config": {"name": "sequential_1", "layers": [{"config": {"trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null, "dtype": "float32", "activation": "relu", "batch_input_shape": [null, 10], "units": 12, "kernel_constraint": null, "name": "dense_4", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null, "dtype": "float32", "activation": "relu", "batch_input_shape": [null, 12], "units": 14, "kernel_constraint": null, "name": "dense_5", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null, "dtype": "float32", "activation": "relu", "batch_input_shape": [null, 14], "units": 16, "kernel_constraint": null, "name": "dense_6", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null, "dtype": "float32", "activation": "relu", "batch_input_shape": [null, 16], "units": 20, "kernel_constraint": null, "name": "dense_7", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null, "dtype": "float32", "activation": "linear", "batch_input_shape": [null, 20], "units": 29, "kernel_constraint": null, "name": "dense_8", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}]}, "inbound_nodes": [[["sequential", 1, 0, {}]]], "class_name": "Sequential"}], "output_layers": [["sequential_1", 1, 0]], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.2.4-tf", "class_name": "Model"}