{"class_name": "Model", "keras_version": "2.2.4-tf", "config": {"name": "model", "input_layers": [["input_1", 0, 0]], "output_layers": [["sequential_1", 1, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 29]}, "inbound_nodes": []}, {"name": "sequential", "class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "use_bias": true, "trainable": true, "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "batch_input_shape": [null, 29], "name": "dense", "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "units": 20}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "use_bias": true, "trainable": true, "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "batch_input_shape": [null, 20], "name": "dense_1", "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "units": 15}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "use_bias": true, "trainable": true, "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "batch_input_shape": [null, 15], "name": "dense_2", "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "units": 10}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "use_bias": true, "trainable": true, "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "batch_input_shape": [null, 10], "name": "dense_3", "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "units": 10}}]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "sequential_1", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "use_bias": true, "trainable": true, "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "batch_input_shape": [null, 10], "name": "dense_4", "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "units": 12}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "use_bias": true, "trainable": true, "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "batch_input_shape": [null, 12], "name": "dense_5", "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "units": 14}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "use_bias": true, "trainable": true, "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "batch_input_shape": [null, 14], "name": "dense_6", "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "units": 16}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "use_bias": true, "trainable": true, "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "batch_input_shape": [null, 16], "name": "dense_7", "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "units": 20}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "use_bias": true, "trainable": true, "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "batch_input_shape": [null, 20], "name": "dense_8", "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "units": 29}}]}, "inbound_nodes": [[["sequential", 1, 0, {}]]]}]}, "backend": "tensorflow"}