{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4-tf", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 29], "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "name": "dense_2", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "batch_input_shape": [null, 29], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "bias_constraint": null, "units": 20}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "name": "dense_3", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "batch_input_shape": [null, 20], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "bias_constraint": null, "units": 15}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "name": "dense_4", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "batch_input_shape": [null, 15], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "bias_constraint": null, "units": 10}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "name": "dense_5", "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "batch_input_shape": [null, 10], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "bias_constraint": null, "units": 10}}], "name": "sequential_1"}, "name": "sequential_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "name": "dense_6", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "batch_input_shape": [null, 10], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "bias_constraint": null, "units": 12}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "name": "dense_7", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "batch_input_shape": [null, 12], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "bias_constraint": null, "units": 14}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "name": "dense_8", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "batch_input_shape": [null, 14], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "bias_constraint": null, "units": 16}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "name": "dense_9", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "batch_input_shape": [null, 16], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "bias_constraint": null, "units": 20}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "name": "dense_10", "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "batch_input_shape": [null, 20], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "bias_constraint": null, "units": 29}}], "name": "sequential_2"}, "name": "sequential_2", "inbound_nodes": [[["sequential_1", 1, 0, {}]]]}], "name": "model", "input_layers": [["input_1", 0, 0]], "output_layers": [["sequential_2", 1, 0]]}}