{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4-tf", "config": {"layers": [{"class_name": "Dense", "config": {"kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "name": "dense", "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "batch_input_shape": [null, 29], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "bias_constraint": null, "units": 10}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "name": "dense_1", "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "batch_input_shape": [null, 10], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "bias_constraint": null, "units": 2}}], "name": "sequential"}}