{"keras_version": "2.2.4-tf", "config": {"name": "sequential", "layers": [{"config": {"batch_input_shape": [null, 3], "kernel_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "dtype": "float32", "bias_constraint": null, "units": 10, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "name": "dense", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"batch_input_shape": [null, 10], "kernel_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "dtype": "float32", "bias_constraint": null, "units": 2, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "sigmoid"}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow"}