{"config": {"name": "model", "layers": [{"name": "input_1", "config": {"batch_input_shape": [null, 3], "name": "input_1", "dtype": "float32", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "sequential", "config": {"name": "sequential", "layers": [{"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "units": 20, "batch_input_shape": [null, 3], "name": "dense", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "use_bias": true, "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "units": 15, "batch_input_shape": [null, 20], "name": "dense_1", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "use_bias": true, "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "units": 10, "batch_input_shape": [null, 15], "name": "dense_2", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "use_bias": true, "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "units": 10, "batch_input_shape": [null, 10], "name": "dense_3", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "use_bias": true, "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear"}, "class_name": "Dense"}]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Sequential"}, {"name": "sequential_1", "config": {"name": "sequential_1", "layers": [{"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "units": 12, "batch_input_shape": [null, 10], "name": "dense_4", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "use_bias": true, "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "units": 14, "batch_input_shape": [null, 12], "name": "dense_5", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "use_bias": true, "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "units": 16, "batch_input_shape": [null, 14], "name": "dense_6", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "use_bias": true, "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "units": 20, "batch_input_shape": [null, 16], "name": "dense_7", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "use_bias": true, "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "units": 3, "batch_input_shape": [null, 20], "name": "dense_8", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "use_bias": true, "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear"}, "class_name": "Dense"}]}, "inbound_nodes": [[["sequential", 1, 0, {}]]], "class_name": "Sequential"}], "output_layers": [["sequential_1", 1, 0]], "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow", "class_name": "Model"}