{"keras_version": "2.2.4-tf", "config": {"name": "model", "layers": [{"inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "name": "input_1", "sparse": false}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "sequential_1", "config": {"name": "sequential_1", "layers": [{"config": {"batch_input_shape": [null, 3], "kernel_regularizer": null, "name": "dense_2", "dtype": "float32", "bias_constraint": null, "units": 20, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "activation": "relu"}, "class_name": "Dense"}, {"config": {"batch_input_shape": [null, 20], "kernel_regularizer": null, "name": "dense_3", "dtype": "float32", "bias_constraint": null, "units": 15, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "activation": "relu"}, "class_name": "Dense"}, {"config": {"batch_input_shape": [null, 15], "kernel_regularizer": null, "name": "dense_4", "dtype": "float32", "bias_constraint": null, "units": 10, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "activation": "relu"}, "class_name": "Dense"}, {"config": {"batch_input_shape": [null, 10], "kernel_regularizer": null, "name": "dense_5", "dtype": "float32", "bias_constraint": null, "units": 10, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "activation": "linear"}, "class_name": "Dense"}]}, "class_name": "Sequential"}, {"inbound_nodes": [[["sequential_1", 1, 0, {}]]], "name": "sequential_2", "config": {"name": "sequential_2", "layers": [{"config": {"batch_input_shape": [null, 10], "kernel_regularizer": null, "name": "dense_6", "dtype": "float32", "bias_constraint": null, "units": 12, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "activation": "relu"}, "class_name": "Dense"}, {"config": {"batch_input_shape": [null, 12], "kernel_regularizer": null, "name": "dense_7", "dtype": "float32", "bias_constraint": null, "units": 14, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "activation": "relu"}, "class_name": "Dense"}, {"config": {"batch_input_shape": [null, 14], "kernel_regularizer": null, "name": "dense_8", "dtype": "float32", "bias_constraint": null, "units": 16, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "activation": "relu"}, "class_name": "Dense"}, {"config": {"batch_input_shape": [null, 16], "kernel_regularizer": null, "name": "dense_9", "dtype": "float32", "bias_constraint": null, "units": 20, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "activation": "relu"}, "class_name": "Dense"}, {"config": {"batch_input_shape": [null, 20], "kernel_regularizer": null, "name": "dense_10", "dtype": "float32", "bias_constraint": null, "units": 3, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "activation": "linear"}, "class_name": "Dense"}]}, "class_name": "Sequential"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["sequential_2", 1, 0]]}, "class_name": "Model", "backend": "tensorflow"}