{"class_name": "Model", "config": {"name": "model", "input_layers": [["input_1", 0, 0]], "output_layers": [["sequential_1", 1, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 3]}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Sequential", "name": "sequential", "config": {"name": "sequential", "layers": [{"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activation": "relu", "trainable": true, "bias_constraint": null, "dtype": "float32", "name": "dense", "kernel_regularizer": null, "bias_regularizer": null, "units": 20, "batch_input_shape": [null, 3], "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activation": "relu", "trainable": true, "bias_constraint": null, "dtype": "float32", "name": "dense_1", "kernel_regularizer": null, "bias_regularizer": null, "units": 15, "batch_input_shape": [null, 20], "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activation": "relu", "trainable": true, "bias_constraint": null, "dtype": "float32", "name": "dense_2", "kernel_regularizer": null, "bias_regularizer": null, "units": 10, "batch_input_shape": [null, 15], "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activation": "linear", "trainable": true, "bias_constraint": null, "dtype": "float32", "name": "dense_3", "kernel_regularizer": null, "bias_regularizer": null, "units": 10, "batch_input_shape": [null, 10], "use_bias": true, "activity_regularizer": null}}]}}, {"inbound_nodes": [[["sequential", 1, 0, {}]]], "class_name": "Sequential", "name": "sequential_1", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activation": "relu", "trainable": true, "bias_constraint": null, "dtype": "float32", "name": "dense_4", "kernel_regularizer": null, "bias_regularizer": null, "units": 12, "batch_input_shape": [null, 10], "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activation": "relu", "trainable": true, "bias_constraint": null, "dtype": "float32", "name": "dense_5", "kernel_regularizer": null, "bias_regularizer": null, "units": 14, "batch_input_shape": [null, 12], "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activation": "relu", "trainable": true, "bias_constraint": null, "dtype": "float32", "name": "dense_6", "kernel_regularizer": null, "bias_regularizer": null, "units": 16, "batch_input_shape": [null, 14], "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activation": "relu", "trainable": true, "bias_constraint": null, "dtype": "float32", "name": "dense_7", "kernel_regularizer": null, "bias_regularizer": null, "units": 20, "batch_input_shape": [null, 16], "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activation": "linear", "trainable": true, "bias_constraint": null, "dtype": "float32", "name": "dense_8", "kernel_regularizer": null, "bias_regularizer": null, "units": 3, "batch_input_shape": [null, 20], "use_bias": true, "activity_regularizer": null}}]}}]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}