{"config": {"layers": [{"config": {"name": "input_1", "batch_input_shape": [null, 13], "dtype": "float32", "sparse": false}, "name": "input_1", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"layers": [{"config": {"bias_constraint": null, "units": 20, "use_bias": true, "kernel_constraint": null, "batch_input_shape": [null, 13], "dtype": "float32", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "dense_2", "activity_regularizer": null, "activation": "relu", "trainable": true}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "units": 15, "use_bias": true, "kernel_constraint": null, "batch_input_shape": [null, 20], "dtype": "float32", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "dense_3", "activity_regularizer": null, "activation": "relu", "trainable": true}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "units": 10, "use_bias": true, "kernel_constraint": null, "batch_input_shape": [null, 15], "dtype": "float32", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "dense_4", "activity_regularizer": null, "activation": "relu", "trainable": true}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "units": 10, "use_bias": true, "kernel_constraint": null, "batch_input_shape": [null, 10], "dtype": "float32", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "dense_5", "activity_regularizer": null, "activation": "linear", "trainable": true}, "class_name": "Dense"}], "name": "sequential_1"}, "name": "sequential_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Sequential"}, {"config": {"layers": [{"config": {"bias_constraint": null, "units": 12, "use_bias": true, "kernel_constraint": null, "batch_input_shape": [null, 10], "dtype": "float32", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "dense_6", "activity_regularizer": null, "activation": "relu", "trainable": true}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "units": 14, "use_bias": true, "kernel_constraint": null, "batch_input_shape": [null, 12], "dtype": "float32", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "dense_7", "activity_regularizer": null, "activation": "relu", "trainable": true}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "units": 16, "use_bias": true, "kernel_constraint": null, "batch_input_shape": [null, 14], "dtype": "float32", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "dense_8", "activity_regularizer": null, "activation": "relu", "trainable": true}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "units": 20, "use_bias": true, "kernel_constraint": null, "batch_input_shape": [null, 16], "dtype": "float32", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "dense_9", "activity_regularizer": null, "activation": "relu", "trainable": true}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "units": 13, "use_bias": true, "kernel_constraint": null, "batch_input_shape": [null, 20], "dtype": "float32", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "dense_10", "activity_regularizer": null, "activation": "linear", "trainable": true}, "class_name": "Dense"}], "name": "sequential_2"}, "name": "sequential_2", "inbound_nodes": [[["sequential_1", 1, 0, {}]]], "class_name": "Sequential"}], "input_layers": [["input_1", 0, 0]], "name": "model", "output_layers": [["sequential_2", 1, 0]]}, "backend": "tensorflow", "keras_version": "2.2.4-tf", "class_name": "Model"}