{"keras_version": "2.2.4-tf", "backend": "tensorflow", "config": {"layers": [{"inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 13], "dtype": "float32", "name": "input_1"}, "name": "input_1", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "sequential", "layers": [{"config": {"trainable": true, "batch_input_shape": [null, 13], "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "units": 20, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "name": "dense", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "batch_input_shape": [null, 20], "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "units": 15, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "batch_input_shape": [null, 15], "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "units": 10, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "name": "dense_2", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "batch_input_shape": [null, 10], "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "units": 10, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "name": "dense_3", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}]}, "name": "sequential", "class_name": "Sequential"}, {"inbound_nodes": [[["sequential", 1, 0, {}]]], "config": {"name": "sequential_1", "layers": [{"config": {"trainable": true, "batch_input_shape": [null, 10], "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "units": 12, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "name": "dense_4", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "batch_input_shape": [null, 12], "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "units": 14, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "name": "dense_5", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "batch_input_shape": [null, 14], "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "units": 16, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "name": "dense_6", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "batch_input_shape": [null, 16], "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "units": 20, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "name": "dense_7", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "batch_input_shape": [null, 20], "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "units": 13, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "name": "dense_8", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}]}, "name": "sequential_1", "class_name": "Sequential"}], "name": "model", "output_layers": [["sequential_1", 1, 0]], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model"}