{"config": {"name": "model", "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 13], "dtype": "float32", "name": "input_1"}, "name": "input_1", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"name": "sequential", "layers": [{"config": {"name": "dense", "bias_constraint": null, "units": 20, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "dtype": "float32", "activation": "relu", "use_bias": true, "batch_input_shape": [null, 13], "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_1", "bias_constraint": null, "units": 15, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "dtype": "float32", "activation": "relu", "use_bias": true, "batch_input_shape": [null, 20], "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_2", "bias_constraint": null, "units": 10, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "dtype": "float32", "activation": "relu", "use_bias": true, "batch_input_shape": [null, 15], "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_3", "bias_constraint": null, "units": 10, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "dtype": "float32", "activation": "linear", "use_bias": true, "batch_input_shape": [null, 10], "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}]}, "name": "sequential", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Sequential"}, {"config": {"name": "sequential_1", "layers": [{"config": {"name": "dense_4", "bias_constraint": null, "units": 12, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "dtype": "float32", "activation": "relu", "use_bias": true, "batch_input_shape": [null, 10], "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_5", "bias_constraint": null, "units": 14, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "dtype": "float32", "activation": "relu", "use_bias": true, "batch_input_shape": [null, 12], "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_6", "bias_constraint": null, "units": 16, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "dtype": "float32", "activation": "relu", "use_bias": true, "batch_input_shape": [null, 14], "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_7", "bias_constraint": null, "units": 20, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "dtype": "float32", "activation": "relu", "use_bias": true, "batch_input_shape": [null, 16], "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_8", "bias_constraint": null, "units": 13, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "dtype": "float32", "activation": "linear", "use_bias": true, "batch_input_shape": [null, 20], "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}]}, "name": "sequential_1", "inbound_nodes": [[["sequential", 1, 0, {}]]], "class_name": "Sequential"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["sequential_1", 1, 0]]}, "keras_version": "2.2.4-tf", "class_name": "Model", "backend": "tensorflow"}