{"config": {"layers": [{"config": {"bias_constraint": null, "units": 10, "use_bias": true, "kernel_constraint": null, "batch_input_shape": [null, 13], "dtype": "float32", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "dense", "activity_regularizer": null, "trainable": true, "activation": "linear", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "units": 2, "use_bias": true, "kernel_constraint": null, "batch_input_shape": [null, 10], "dtype": "float32", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "dense_1", "activity_regularizer": null, "trainable": true, "activation": "sigmoid", "kernel_regularizer": null}, "class_name": "Dense"}], "name": "sequential"}, "backend": "tensorflow", "keras_version": "2.2.4-tf", "class_name": "Sequential"}